# HideUnreferenceViewTags Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BaseExportOptions..::..HideUnreferenceViewTags Property
BaseExportOptions Class See Also
---
Whether or not to hide unreference view tags. Default value is false.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool HideUnreferenceViewTags { get; set; }
```

Visual Basic
---
```text
Public Property HideUnreferenceViewTags As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool HideUnreferenceViewTags {
	bool get ();
	void set (bool value);
}
```

# See Also
BaseExportOptions Class
Autodesk.Revit.DB Namespace